qinyunti/py32f403-nes/proj/PY32F403_HAL_Driver/Inc/py32f403_hal_canfd.h
#define CANFD_IT_ALL_ERROR                 (CANFD_IT_ERROR_TOGGLE | CANFD_IT_RX_FIFO_OVERFLOW | \
                                            CANFD_IT_ARB_LOST     | CANFD_IT_ERROR_PASSIVE    | \
                                            CANFD_IT_BUS_ERROR)
/**
  * @}
  */

/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/
/** @defgroup CANFD_Exported_Macros CANFD Exported Macros
  * @{
  */

/**
  * @brief  Enable the specified CANFD interrupts.
  * @param  __HANDLE__ CANFD handle.
  * @param  __INTERRUPT__ CANFD interrupt.
  *         This parameter can be any combination of @arg CANFD_Interrupts
  * @retval None
  */
#define __HAL_CANFD_ENABLE_IT(__HANDLE__, __INTERRUPT__)             \
  (__HANDLE__)->Instance->IER |= (__INTERRUPT__)

/**
  * @brief  Disable the specified CANFD interrupts.
  * @param  __HANDLE__ CANFD handle.
  * @param  __INTERRUPT__ CANFD interrupt.
  *         This parameter can be any combination of @arg CANFD_Interrupts
  * @retval None
  */
#define __HAL_CANFD_DISABLE_IT(__HANDLE__, __INTERRUPT__)               \
  ((__HANDLE__)->Instance->IER) &= ~(__INTERRUPT__)
  
/** @brief  Check if the specified CANFD interrupt source is enabled or disabled.
  * @param  __HANDLE__ CANFD handle.
  * @param  __INTERRUPT__ specifies the CANFD interrupt source to check.
  *         This parameter can be a value of @arg CANFD_Interrupts
  * @retval ITStatus
  */
#define __HAL_CANFD_GET_IT_SOURCE(__HANDLE__, __INTERRUPT__) ((__HANDLE__)->Instance->IER & (__INTERRUPT__))

/**
  * @brief  Check whether the specified CANFD flag is set or not.
  * @param  __HANDLE__ CANFD handle.
  * @param  __FLAG__ CANFD flag.
  *         This parameter can be one of @arg CANFD_flags
  * @retval FlagStatus
  */
#define __HAL_CANFD_GET_FLAG(__HANDLE__, __FLAG__) ((__HANDLE__)->Instance->IFR & (__FLAG__))

/**
  * @brief  Clear the specified CANFD flags.
  * @param  __HANDLE__ CANFD handle.
  * @param  __FLAG__ specifies the flags to clear.
  *         This parameter can be any combination of @arg CANFD_flags
  * @retval None
  */
#define __HAL_CANFD_CLEAR_FLAG(__HANDLE__, __FLAG__)             \
  ((__HANDLE__)->Instance->IFR) = (__FLAG__)

/** @brief  Return Rx FIFO fill level.
  * @param  __HANDLE__ CANFD handle.
  * @retval Rx FIFO fill level.
  */
#define __HAL_CANFD_GET_RX_FIFO_FILL_LEVEL(__HANDLE__) ((__HANDLE__)->Instance->MCR & CANFD_MCR_RSTAT)

/** @brief  Return STB FIFO free level.
  * @param  __HANDLE__ CANFD handle.
  * @retval STB FIFO free level.
  */
#define __HAL_CANFD_GET_STB_FIFO_FREE_LEVEL(__HANDLE__) ((__HANDLE__)->Instance->MCR & CANFD_MCR_TSSTAT)

/**
  * @brief  Enable canbus OFF.
  * @param  __HANDLE__ CANFD handle.
  * @retval None
  */
#define __HAL_CANFD_EnableCanBusOff(__HANDLE__)  (SET_BIT((__HANDLE__)->Instance->MCR, CANFD_MCR_BUSOFF))

/**
  * @brief  Disable canbus OFF.
  * @param  __HANDLE__ CANFD handle.
  * @retval None
  */
#define __HAL_CANFD_DisableCanBusOff(__HANDLE__)  (CLEAR_BIT((__HANDLE__)->Instance->MCR, CANFD_MCR_BUSOFF))
/**
  * @}
  */

/* Private macros ------------------------------------------------------------*/
/** @defgroup CNAFD_Private_Macros CANFD Private Macros
  * @{
  */

#define IS_CANFD_FRAME_FORMAT(FORMAT)   (((FORMAT) == CANFD_FRAME_CLASSIC) || \
                                         ((FORMAT) == CANFD_FRAME_FD_NO_BRS) || \
                                         ((FORMAT) == CANFD_FRAME_FD_BRS))
#define IS_CANFD_MODE(MODE)  (((MODE) == CANFD_MODE_NORMAL) || \
                              ((MODE) == CANFD_MODE_RESTRICTED_OPERATION) || \
                              ((MODE) == CANFD_MODE_LOOPBACK_EXT_NOACK) || \
                              ((MODE) == CANFD_MODE_LOOPBACK_EXT_ACK) || \
                              ((MODE) == CANFD_MODE_LOOPBACK_INT) || \
                              ((MODE) == CANFD_MODE_SILENT) || \
                              ((MODE) == CANFD_MODE_SILENT_LOOPBACK))
#define IS_CANFD_CANFD_PROTOCOL(PROTOCOL)  (((PROTOCOL) == CANFD_FD_BOSCH) || \
                                            ((PROTOCOL) == CANFD_FD_ISO_11898))
#define IS_CANFD_CKDIV(DIV)  (((DIV) >= 1U) && ((DIV) <= 32U))
#define IS_CANFD_NOMINAL_SJW(SJW)  (((SJW) >= 1U) && ((SJW) <= 128U))
#define IS_CANFD_NOMINAL_TSEG1(TSEG1)  (((TSEG1) >= 2U) && ((TSEG1) <= 513U))
#define IS_CANFD_NOMINAL_TSEG2(TSEG2)  (((TSEG2) >= 1U) && ((TSEG2) <= 128U))
#define IS_CANFD_DATA_SJW(SJW)  (((SJW) >= 1U) && ((SJW) <= 128U))
#define IS_CANFD_DATA_TSEG1(TSEG1)  (((TSEG1) >= 2U) && ((TSEG1) <= 257U))
#define IS_CANFD_DATA_TSEG2(TSEG2)  (((TSEG2) >= 1U) && ((TSEG2) <= 128U))
#define IS_CANFD_SSPOFF(SSPOFF)  ((SSPOFF) <= 255U)

#define IS_CANFD_ID_TYPE(TYPE)   (((TYPE) == CANFD_STANDARD_ID) || \
                                  ((TYPE) == CANFD_EXTENDED_ID))
#define IS_CANFD_FILTER_CHANNEL(CHANNEL)  ((CHANNEL) <= CANFD_FILTER_CHANNEL_11)
#define IS_CANFD_RANK(RANK)   (((RANK) == CANFD_FILTER_RANK_CHANNEL_NUMBER) || \
                               ((RANK) == CANFD_FILTER_RANK_NONE))
#define IS_CANFD_FILTER_ID(ID)  ((ID) <= 0x1FFFFFFFU)
#define IS_CANFD_FILTER_FORMAT(FORMAT)  ((FORMAT) <= 0x1F1707FFU)
#define IS_CANFD_MASK_ID(ID)  ((ID) <= 0x1FFFFFFFU)
#define IS_CANFD_MASK_FORMAT(FORMAT)  ((FORMAT) <= 0x1F1707FFU)

#define IS_CANFD_MAX_VALUE(ID, VALUE)  ((ID) <= VALUE)
#define IS_CANFD_TX_FRAME_TYPE(TYPE)   (((TYPE) == CANFD_DATA_FRAME) || \
                                        ((TYPE) == CANFD_REMOTE_FRAME))
#define IS_CANFD_Handle(ID)  ((ID) <= 0xFFU)
#define IS_CANFD_DLC(DLC)  ((DLC) <= CANFD_DLC_BYTES_64)
#define IS_CANFD_TX_FIFO_TYPE(TYPE)   (((TYPE) == CANFD_TX_FIFO_PTB) || \
                                        ((TYPE) == CANFD_TX_FIFO_STB))

#define IS_CANFD_TRANSMIT_MODE(MODE)   (((MODE) == CANFD_TXFIFO_PTB_SEND) || \
                                        ((MODE) == CANFD_TXFIFO_STB_SEND_ONE) || \
                                        ((MODE) == CANFD_TXFIFO_STB_SEND_ALL))

#define IS_CANFD_REARBITRATION_LIMIT(LIMIT)  ((LIMIT) <= CANFD_AUTO_REARBITRATION_NO_LIMIT)

#define IS_CANFD_RETRANSMISSION_LIMIT(LIMIT)  ((LIMIT) <= CANFD_AUTO_RETRANSMISSION_NO_LIMIT)

#define IS_CANFD_STB_PRIORITY(PRIORITY)   (((PRIORITY) == CANFD_STB_PRIORITY_FIFO) || \
                                           ((PRIORITY) == CANFD_STB_PRIORITY_ID))

#define IS_CANFD_RX_FIFO_MODE(MODE)   (((MODE) == CANFD_RX_FIFO_OVERWRITE) || \
                                       ((MODE) == CANFD_RX_FIFO_BLOCKING))

#define IS_CANFD_RX_FIFO_THRESHOLD(THRESHOLD)   (((THRESHOLD) == CANFD_RX_FIFO_THRESHOLD_1SLOT) || \
                                                 ((THRESHOLD) == CANFD_RX_FIFO_THRESHOLD_2SLOTS) || \
                                                 ((THRESHOLD) == CANFD_RX_FIFO_THRESHOLD_3SLOTS))

#define IS_CANFD_TT_FIFO_MODE(MODE)   (((MODE) == CANFD_TT_FIFO_PTB_STB) || \
                                       ((MODE) == CANFD_TT_FIFO_MERGE))
#define IS_CANFD_TT_PRESCALER(PRESCALER)   (((PRESCALER) == CANFD_TT_PRESC_1) || \
                                            ((PRESCALER) == CANFD_TT_PRESC_2) ||\
                                            ((PRESCALER) == CANFD_TT_PRESC_4) ||\
                                            ((PRESCALER) == CANFD_TT_PRESC_8))
#define IS_CANFD_TX_ENABLE_WINDOW(WINDOW)  (((WINDOW) >= 1U) && ((WINDOW) <= 15U))
#define IS_CANFD_WATCH_TRIG_TIME(TIME)  ((TIME) <= 0xFFFFU)
/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @addtogroup CANFD_Exported_Functions CANFD Exported Functions
  * @{
  */

/** @addtogroup CANFD_Exported_Functions_Group1 Initialization and de-initialization functions
  * @{
  */

/* Initialization/de-initialization functions  **********************************/
HAL_StatusTypeDef HAL_CANFD_Init(CANFD_HandleTypeDef *hcanfd);
void HAL_CANFD_MspInit(CANFD_HandleTypeDef *hcan);

/* Callbacks Register/UnRegister functions  ***********************************/
#if USE_HAL_CANFD_REGISTER_CALLBACKS == 1
HAL_StatusTypeDef HAL_CANFD_RegisterCallback(CANFD_HandleTypeDef *hcanfd, HAL_CANFD_CallbackIDTypeDef CallbackID, void (* pCallback)(CANFD_HandleTypeDef *_hCANFD));
#endif /* USE_HAL_CANFD_REGISTER_CALLBACKS */
/**
  * @}
  */

/** @addtogroup CANFD_Exported_Functions_Group2 IO operation functions
  * @{
  */

